app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment].permit(:content))
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 4 LIMIT 1
INSERT INTO `comments` (`content`, `created_at`, `updated_at`, `post_id`) VALUES ('nooooooooooo', '2020-03-27 02:19:18', '2020-03-27 02:19:18', 4)

def edit
  @comment = Comment.find(params[:id])
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 4 LIMIT 1

def update
  @comment = Comment.find(params[:id])
  @comment.update(params[:comment].permit(:content))
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 4 LIMIT 1
UPDATE `comments` SET `content` = 'nnnnnnyyyyyy', `updated_at` = '2020-03-27 02:19:30' WHERE `comments`.`id` = 4