app/controllers/posts_controller.rb

  def index
    @posts = Post.order("updated_at DESC")
---
SELECT `posts`.* FROM `posts` ORDER BY updated_at DESC

  def create
    post_params = params.require('post').permit(:title, :content)
    @post = Post.create(post_params)
---
INSERT INTO `posts` (`title`, `content`, `created_at`, `updated_at`) VALUES ('fsfg', 'lkmlkmkl klmnklm lkml lk', '2020-03-27 02:44:03', '2020-03-27 02:44:03')

  def update
    @post = Post.find(params[:id])
    post_params = params.require('post').permit(:title, :content)
    @post.update(post_params)
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 4 LIMIT 1
UPDATE `posts` SET `title` = 'iiiiii2222edit', `content` = 'kmklmkm2222edit', `updated_at` = '2020-03-27 02:39:02' WHERE `posts`.`id` = 4